Repository: cfmfhe/wp-plugins
Catalog: pw-gift-cards/languages/pw-woocommerce-gift-cards-*.po
Languages: fi

source: You can fully customize the gift card email to suit your needs. We use the built in WooCommerce email template system. To override the email you should copy this file
fi: Voit räätälöidä lahjakorttiviestin täysin haluamasi mukaan. Käytämme WooCommeren sähköpostijärjestelmää. Omia muutoksia varten kopioi tämä tiedosto

source: To here
fi: Tähän

source: You may need to create the subfolders if they do not exist in your theme folder. Once the file is in your theme folder, open it up in a text editor and make any changes.
fi: Sinun täytyy mahdollisesti luoda alikansiot, jos niitä ei vielä ole teemakansiossasi. Kun tiedoston on teemakansiossasi, avaa se tekstinmuokkaimella ja tee tarvittavat muutokset.

source: Save design
fi: Tallenna ulkoasu

source: Delete design
fi: Poista ulkoasu

source: Custom template file detected!
fi: Sivustokohtainen mallipohja havaittu!

source: It appears as though you already have a custom email template file, your changes in the Designer may not appear when you actually send the email. Click the Send Preview Email button to confirm.
fi: Näyttää siltä, että sinulla olisi jo räätälöity sähköpostimallipohja käytössä, joten muutoksesi suunnittelutyökalussa eivät välttämättä näy sellaisenaan sähköpostiviestissä. Lähetä esikasteluviesti itsellesi tarkistaaksesi muutokset.

source: Preview
fi: Esikatsele

source: Send a preview email
fi: Lähetä esikatseluviesti

source: THIS IS ONLY A PREVIEW
fi: TÄMÄ ON AINOASTAAN ESIKATSELUA VARTEN

source: No cards have been imported yet. If the results look good, click on the "Import cards" button below to actually create the gift cards.
fi: Yhtään lahjakorttia ei ole tuotu vielä. Jos esikatselu näyttää hyvältä, niin klikkaa tuontipainiketta alta lahjakorttien tuomiseksi ja luomiseksi.

source: Email the gift card to the recipient if email address is included in the import.
fi: Lähetä lahjakortti sähköpostilla vastaanottajalle, jos sähköpostiosoite sisältyy tuontiin.

source: Import cards
fi: Tuo lahjakortteja

source: Row
fi: Rivi

source: Card Number
fi: Lahjakortin numero

source: Expiration Date
fi: Viimeinen käyttöpäivä

source: Recipient
fi: Vastaanottaja

source: Result
fi: Tulos

source: ERROR: %s
fi: VIRHE: %s

source: %s valid
fi: %s voimassa

source: %s invalid
fi: %s ei ole kelvollinen

source: %s total records processed
fi: %s tietuetta käsitelty

source: Import CSV File
fi: Tuo CSV tiedosto

source: Upload CSV File
fi: Lataa CSV-tiedosto

source: Instructions
fi: Ohjeet

source: Import a comma-separated value file (CSV) of existing gift card numbers. This is useful for importing physical gift cards sold to customers. You will see a preview of the results before anything is saved to the database.
fi: Tuo CSV-tiedostlla olemassa olevia lahjakortin numeroita. Tämä hyödyllistä, jos myyt myös fyysisiä lahjakortteja asiakkaillesi. Näet tuontitietojen esikatselun ennen kuin mitään tallennetaan tietokantaan.

source: The CSV should NOT have a header and the columns must be in this order:
fi: CSV tiedostossa ei tulisi olla otsikkoriviä ja palstojen tulee olla tässä järjestyksessä:

source: Gift Card Number, Balance, Expiration Date (optional), Recipient Email (optional)
fi: Lahjakortin numero, saldo, viimeinen käyttöpäivä (valinnainen), vastaanottajan sähköpostiosoite (valinnainen)

source: Email %s if you need assistance.
fi: Lähetä viesti %s, jos tarvitset apua.

source: Card has been deleted.
fi: Lahjakortti poistettu.

source: View activity
fi: Näytä toiminta

source: Add a note
fi: Lisää viesti

source: Adjust balance
fi: Muokkaa saldoa

source: Set expiration date
fi: Aseta viimeinen käyttöpäivä

source: Email Gift Card
fi: Lähetä lahjakortti

source: Delete
fi: Poista

source: Restore
fi: Palauta

source: Delete Permanently
fi: Poista lopullisesti

source: Load more
fi: Lataa lisää

source: Are you sure you want to delete this gift card?
fi: Oletko varma, että haluat poistaa tämän lahjakortin?

source: Are you sure you want to PERMANENTLY delete this gift card? This action cannot be undone!
fi: Haluatko varmasti poistaa pysyvästi tämän lahjakortin? Tätä toimintoa ei voi peruuttaa!

source: No results
fi: Ei tuloksia

source: There are no gift cards found matching your search terms.
fi: Hakuasi vastaavia lahjakortteja ei löytynyt.

source: Not receiving gift card emails?
fi: Etkö saa lahjakorttien sähköpostiviestejä?

source: Confirm that the Order Status is "Complete" for the gift cards purchased. You should see the Gift Card number along with the recipient email in the Order line items inside the admin area. If the order is Complete and it shows the Gift Card number, try disabling the WooCommerce Transactional Email System for the gift cards below.
fi: Vahvista, että tilauksen tila on "Valmis" ostetulle lahjakortille. Sinun pitäisi nähdä lahjakortin numero vastaanottajan sähköpostiosoitteen lisäksi tilauksen tuotelistassa ohjausnäkymässä. Jos tilaus on valmis ja näyttää lahjakortin numeron, voi kokeilla poistaa WooCommercen sähkpostijärjestelmän lahjakorttien osalta.

source: Save Settings
fi: Tallenna asetukset

source: Could not find activity record %d.
fi: Tapahtumamerkintää %d ei löytynyt.

source: Invalid action value:
fi: Toimintoarvo ei kelpaa:

source: Card number does not exist.
fi: Lahjakortin numeroa ei löytynyt.

source: Enter a card number.
fi: Syötä lahjakortin numero.

source: Expired
fi: Vanhentunut

source: Amount added should be greater than zero.
fi: Summan tulisi olla suurempi kuin nolla.

source: Amount deducted should be less than zero.
fi: Vähennettävän summan tulisi olla vähemmän kuin nolla.

source: Unable to adjust balance, card is not active.
fi: Saldon muuttaminen ei onnistunut, lahjakortti ei ole käytössä.

source: Balance is currently %s, unable to adjust by %s
fi: Saldo tällä hetkellä %s, ei voi muuttaa summalla %s

source: Card Number cannot be empty.
fi: Lahjakortin numero ei voi olla tyhjä.

source: Gift Card %s was inserted into table %s and received database id %s but it could not be retrieved. Last error: %s
fi: Lahjakortti %s lisättiin taulukkoon %s ja vastaanotettiin tietokannan tunnus %s, mutta sitä ei voitu hakea. Viimeinen virhe: %s

source: Gift Card %s could not be inserted into table %s. Last error: %s
fi: Lahjakorttia %s ei voitu asettaa taulukkoon %s. Viimeinen virhe: %s

source: Unknown error in add_card method.
fi: Tuntematon virhe add_card-menetelmässä.

source: Failed to generate a unique random card number after %d attempts. %s
fi: Yksilöllisen satunnaisnumeron luominen lahjakortille epäonnistui %s yrityksen jälkeen. %s

source: Property %s does not exist on %s
fi: Ominaisuutta %s ei löytynyt %s

source: Amount already exists:
fi: Summa on jo olemassa:

source: Could not create variation.
fi: Muunnelman luonti epäonnistui.

source: Could not locate variation using variation_id
fi: Muunelmaa ei löytynyt variation_id tietueella

source: Select amount
fi: Valitse summa

source: PW Gift Card Email
fi: PW Lahjakortti sähköposti

source: This email is sent to the recipients of a gift card.
fi: Tämä sähköpostiviesti lähetetään lahjakortin vastaanottajalle.

source: You were given a gift card
fi: Olet saanut lahjakortin

source: {sender} sent you a gift card
fi: {sender} lähetti sinulle lahjakortin

source: Gift Card for Order #
fi: Lahjakortti tilaukselle #

source: Enable/Disable
fi: Ota käyttöön / poista käytöstä

source: Enable this email notification
fi: Ota käyttöön sähköposti-ilmoitukset

source: Subject
fi: Aihe

source: This controls the email subject line. Leave blank to use the default subject: <code>%s</code>.
fi: Tämä määrittää sähköpostiviestin otsikon. Jätä tyhjäksi käyttääksesi oletusotsikkoa: <code>%s</code>.

source: Email Heading
fi: Sähköpostin otsikko

source: This controls the main heading contained within the email notification. Leave blank to use the default heading: <code>%s</code>.
fi: Tämä määrittää sähköposti-ilmoituksen pääotsikon. Jätä tyhjäksi käyttääksesi oletusotsikkoa: <code>%s</code>.

source: Email type
fi: Sähköpostin tyyppi

source: Choose which format of email to send.
fi: Valitse sähköpostin lähetysmuoto.

source: Plain text
fi: Pelkkä teksti

source: Multipart
fi: Moniosainen

source: Choose an amount
fi: Valitse summa

source: The minimum amount is %s.
fi: Vähimmäismäärä on %s.

source: The maximum amount is %s.
fi: Enimmäismärää on %s.

source: Amount is required
fi: Määrä vaaditaan

source: Order %s purchased by %s %s
fi: Tilauksen %s osti %s %s

source: Unable to retrieve variation
fi: Muunnelman noutaminen ei onnistunut

source: Bonus Gift Card
fi: Lisälahjakortti

source: Bonus
fi: Lisä

source: Generated and emailed after the order is marked Complete.
fi: Luodaan ja lähetetään sähköpostitse tilauksen merkitsemisen jälkeen Valmis.

source: Shipping via %s
fi: Toimitustapa %s

source: This gift card has a zero balance.
fi: Tällä lahjakortilla ei ole saldoa jäljellä.

source: Gift card applied.
fi: Lahjakortti käytetty.

source: Gift card removed.
fi: Lahjakortti poistettu.

source: Gift cards cannot be used to purchase other gift cards.
fi: Lahjakortteja ei voi käyttää toisten lahjakorttien ostamiseen.

source: This gift card is expired.
fi: Tämä lahjakortti on vanhentunut.

source: Card is inactive.
fi: Lahjakortti ei ole käytössä.

source: Orders
fi: Tilaukset

source: Default
fi: Oletus

source: %s Gift Card
fi: %s lahjakortti

source: Happy Birthday
fi: Hyvää syntymäpäivää

source: Happy Anniversary
fi: Hyvää vuosipäivää

source: Congratulations
fi: Onnittelut

source: Happy Holidays
fi: Hyvää joulua

source: Merry Christmas
fi: Hauskaa joulua

source: Other amount
fi: Muu summa

source: Gift Card Amount
fi: Lahjakortin summa

source: Adding to Gift Card
fi: Lisätään lahjakortille

source: Reloaded
fi: Saldoa lisätty

source: To
fi: Vastaanottaja

source: Message
fi: Viesti

source: Delivery Date
fi: Toimituspäivämäärä

source: Bonus Amount
fi: Lisäsumma

source: Required
fi: Pakollinen

source: Amount to debit?
fi: Debit summa?

source: Minimum amount is %s
fi: Vähimmäismäärä on %s

source: Maximum amount is %s
fi: Enimmäismäärä on %s

source: The "To" field should only contain email addresses. The following recipients do not look like valid email addresses:
fi: Vastaanottajakentässä tulisi olla vain sähköpostiosoitteita. Seuraavat vastaanottajat eivät näytä kelvollisilta sähköpostiosoitteilta:

source: Previous Month
fi: Edellinen kuukausi

source: Next Month
fi: Seuraava kuukausi

source: January
fi: Tammikuu

source: February
fi: Helmikuu

source: March
fi: Maaliskuu

source: April
fi: Huhtikuu

source: May
fi: Toukokuu

source: June
fi: Kesäkuu

source: July
fi: Heinäkuu

source: August
fi: Elokuu

source: September
fi: Syyskuu

source: October
fi: Lokakuu

source: November
fi: Marraskuu

source: December
fi: Joulukuu

source: Sun
fi: Su

source: Mon
fi: Ma

source: Tue
fi: Ti

source: Wed
fi: Ke

source: Thu
fi: To

source: Fri
fi: Pe

source: Sat
fi: La

source: Sunday
fi: Sunnuntai

source: Monday
fi: Maanantai

source: Tuesday
fi: Tiistai

source: Wednesday
fi: Keskiviikko

source: Thursday
fi: Torstai

source: Friday
fi: Perjantai

source: Saturday
fi: Lauantai

source: %s requires WooCommerce version %s or later.
fi: %s vaatii WooCommerce version %s tai uudemman.

source: PW Gift Card Redeemed.
fi: PW Lahjakortti lunastettu.

source: Gift Card:
fi: Lahjakortti:

source: Gift card number
fi: Lahjakortin numero

source: Apply gift card
fi: Käytä lahjakortti

source: Please wait...
fi: Odota, ole hyvä...

source: Have a gift card?
fi: Onko sinulla lahjakortti?

source: Gift card
fi: Lahjakortti

source: Remaining balance is %s
fi: Saldoa jäljellä %s

source: Gift Card Total
fi: Lahjakortti yhteensä

source: [Remove]
fi: [Poista]

source: Click here to enter your gift card number
fi: Klikkaa tästä syöttääksesi lahjakortin numeron

source: If you have a gift card number, please apply it below.
fi: Jos sinulla on lahjakortin numero, niin syötä se alla olevaan kenttään.

source: Apply Gift Card
fi: Käytä lahjakortti

source: Gift Card Number
fi: Lahjakortin numero

source: Expires
fi: Vanhentuu

source: Redeem
fi: Lunasta

source: Amount: %s
fi: Summa: %s

source: Gift card number: %s
fi: Lahjakortin numero: %s

source: Link: %s
fi: Linkki: %s

source: Message:
fi: Viesti:

source: Check Gift Card Balance
fi: Tarkista lahjakortin saldo

source: Check Balance
fi: Tarkista saldo

source: Add more funds to this gift card.
fi: Lataa lisää saldoa tälle lahjakortille.

source: Debit Balance
fi: Debit saldo

source: Gift card will be delivered to the Shipping Address entered during checkout.
fi: Lahjakortti toimitetaan kassalla annettuun toimitusosoitteeseen .

source: Enter an email address for each recipient
fi: Syötä jokaisen vastaanottajan sähköpostiosoitteet

source: Separate multiple email addresses with a comma.
fi: Erota sähköpostiosoitteet pilkulla.

source: Enter a friendly name for the recipient (optional).
fi: Syötä hellittelynimi vastaanottajalle (valinnainen).

source: Your name
fi: Nimesi

source: (optional)
fi: (valinnainen)

source: Add a message
fi: Lisää viesti

source: characters remaining
fi: merkkiä jäljellä

source: Now
fi: Nyt

source: Up to a year from today
fi: Enintään vuoden päähän tästä päivästä

source: Quantity
fi: Lukumäärä

source: 1 to each recipient
fi: 1 jokaiselle vastaanottajalle

source: You are adding funds to the following gift card:
fi: Olet lisäämässä saldoa lahjakortille:

source: Sell gift cards in your WooCommerce store.
fi: Myy lahjakortteja WooCommerce-verkkokaupassa.
