Repository: cfmfhe/wp-plugins
Catalog: pw-gift-cards/languages/pw-woocommerce-gift-cards-*.po
Languages: fi

source: Allow Scheduled Delivery
fi: Salli ajastettu toimitus

source: Provides a "Delivery Date" for the purchasing customer to specify that the gift card should be delivered on a certain date. Otherwise gift cards are delivered as soon as the order is marked Complete. Default: Checked.
fi: Antaa maksajan valita lahjakortille toimituspäivän. Muussa tapauksessa lahjakortti lähetetään vastaanottajalle heti, kun tilauksen tila on Valmis. Oletus: käytössä.

source: Auto Complete Orders
fi: Hyväksy auotmaattisesti tilaukset

source: When an order only contains gift cards, automatically mark the order as Complete to send the gift cards immediately.
fi: Kun tilaus sisältää vain lahjakortteja, aseta tilaus automaattisesti Valmis tilaan, jotta lahjakortit lähetetään heti.

source: Send When Order Received
fi: Lähetä, kun tilaus on vastaanotettu

source: By default we wait until the order status is Complete before generating and emailing the gift card. Check this box to send the gift card immediately when the order is received. Scheduled gift cards will still be sent on the scheduled date. Default: Unchecked
fi: Oletuksena odotamme kunnes tilauksen tila on Valmistunut ennen kuin lahjakortti luodaan ja lähetetään. Valitse tämä valinta, jotta lahjakortti lähetetään heti, kun tilaus on vastaanotettu. Ajastetut lahjakortit lähetetään kuitenkin valittuna ajankohtana. Oletus: ei käytössä

source: Disable Expiration Date
fi: Poista vanhenemispäivämäärä käytöstä

source: If the law in your area prohibits an expiration date for gift cards, you can disable Expiration Dates system wide. This will hide all buttons, options, and mention of an expiration date. Default: Unchecked.
fi: Jos omalla alueellasi oleva laki kieltää lahjakorttien vanhenemispäivän, voit poistaa vanhenemispäivämäärät käytöstä koko järjestelmän. Tämä piilottaa kaikki painikkeet, vaihtoehdot ja viimeisen käyttöpäivän maininnan. Oletus: Ei valittu.

source: Buy Gift Cards with Gift Cards
fi: Osta lahjakortteja lahjakorteilla

source: Allow customers to purchase gift cards using another gift card. Disable this to prevent customers from extending the date on expiring gift cards. Default: Checked.
fi: Salli asiakkaiden ostaa lahjakortteja toisilla lahjakorteilla. Tämän poistaminen käytöstä estää asiakkaita pidentämästä vanhenevien lahjakorttien voimassaoloa. Oletus: sallittu.

source: Check Balance on My Account
fi: Tarkista tilini saldo

source: When enabled, a link to the Check Balance page will be added to the My Account page. Default: checked
fi: Kun tämä on käytössä, Oma tili -sivulle lisätään linkki Tarkista saldo -sivulle. Oletus: valittu

source: Allow Reloading
fi: Salli saldon lisääminen

source: When enabled, customers can add funds to an existing gift card from the Check Balance page.
fi: Valittuna asiakkaat voivat lisätä saldoa lahjakorteille saldontarkitussivulta.

source: Allow Manual Debit
fi: Salli manuaalien käyttö

source: When enabled, customers or store employees can debit funds from an existing gift card from the Check Balance page. Useful for physical stores where customers will redeem the card for in store purchases.
fi: Valittuna, asiakas tai kaupan työntekijä voi vähentää saldoa olemassa olevalta lahjakortilta saldontarkistussivulta. Tätä voi käyttää kivijalkaliikkeessä, kun asiakas lunastaa lahjakortin kaupassa tehtävien ostostensa yhteydessä.

source: Show Activity on Check Balance Page
fi: Näytä aktiviteetti tasapainosivulla

source: When enabled, detailed transaction history will be shown on the Check Balance page.
fi: Kun tämä on käytössä, yksityiskohtainen tapahtumahistoria näkyy Check Balance -sivulla.

source: Use the WooCommerce Transactional Email System
fi: Käytä WooCommercen sähköpostijärjestelmää

source: Enabled by default. If you are not receiving your gift card emails, try disabling this setting.
fi: Käytössä oletuksena. Jos et saa sähköpostiviestejä lahjakorteista, kokeile poistaa tämä asetus käytöstä.

source: Apply Fix For Missing Fields
fi: Korjaa puuttuvat tietokentät

source: If you do not see the To / From / Message fields on your gift card product page, try checking this box and reloading. Some themes have out of date WooCommerce template files and need to be patched to work with the Gift Card product.
fi: Jos et näe lähettäjä / vastaanottaja / viesti kenttiä lahjakorttisi tutoesivulla, kokeile valita tämä asetus ja ladata sivu uudelleen. Jotkin teemat käyttävät vanhentuneita WooComemrce sivupohjia ja tarvitsevat paikan toimiakseen oikein lahjakorttien kanssa.

source: Format Prices
fi: Hinnan muotoilu

source: For fixed gift card amounts, format the price with the system currency symbol. This is enabled by default. If you are having trouble with currency switchers, disable this setting. Note: You must remove and re-add your fixed gift card amounts if you change this setting.
fi: Kiinteille lahjakortin summille, lisää hintaan järjestelmän valuuttamerkki. Tämä on käytössä oletuksena. Jos sinulla on ongelmia valuuttamuuntimien kanssa, poista tämä asetus käytöstä. Huom. sinun täytyy poistaa ja lisätä uudelleen kiinteät lahjakorttisummat, jos muutat tätä asetusta.

source: Pre-populate the "From" Field
fi: Esitäytä "Lähettäjä" -kenttä

source: If the customer is logged in, populate the From field with the Display Name value for their account. Default: Checked.
fi: Jos asiakas on kirjautunut sisään, täytä Lähettäjä-kenttä tilin näyttönimellä. Oletus: valittu.

source: Allow Multiple Recipients
fi: Salli useita vastaanottajia

source: Similar to how Amazon works, allow multiple recipient email addresses when purchasing a gift card. Default: Checked.
fi: Salli kuten Amazon toimii, salli useiden vastaanottajan sähköpostiosoitteiden ostaminen lahjakortti. Oletus: valittu.

source: Carbon Copy
fi: Kopio

source: When a gift card is emailed, carbon copy these addresses. Separate multiple emails with a comma.
fi: Kun lahjakorttiviesti lähetetään, kopio lähetetään näihin osoitteisiin. Erota sähköpostiosoitteet pilkulla.

source: Blind Carbon Copy
fi: Piilokopio

source: When a gift card is emailed, blind carbon copy these addresses. Separate multiple emails with a comma.
fi: Kun lahjakorttiviesti lähetetään, piilokopio lähetetään näihin osoitteisiin. Erota sähköpostiosoitteet pilkulla.

source: Send to the Buyer
fi: Lähetä ostajalle

source: When a gift card is emailed, blind carbon copy the gift card to the purchasing customer.
fi: Kun lahjakorttiviesti lähetetään, maksajalle toimitetaan piilokopio lahjakortista.

source: Redeem Location - Cart
fi: Lunasta-painikkeen sijainti - Ostoskori

source: Specifies where the "Apply Gift Card" box appears on the Cart page.
fi: Määrittää, missä "Käytä lahjakortti" kenttä näytetään ostoskorisivulla.

source: Above the "Proceed to Checkout" button.
fi: "Siirry maksamaan" painikkeen yläpuolella.

source: Below the "Apply Coupon" area.
fi: "Käytä kuponki" alueen alapuolella.

source: Do not display gift card field.
fi: Älä näytä lahjakorttikenttää.

source: Redeem Location - Checkout
fi: Lunasta-painikkeen sijainti - Kassa

source: Specifies where the "Apply Gift Card" box appears on the Checkout page.
fi: Määrittää, missä "Käytä lahjakortti" kenttä näytetään kassasivulla.

source: Below the "Payment Methods" area.
fi: "Maksutavat" alueen alapuolella.

source: Coupon Code Field Input
fi: Kuponkikoodin tekstikenttä

source: Allow gift card numbers to be entered into the Coupon Code field to be redeemed. Default: checked.
fi: Salli lahjakorttien numeroiden syöttäminen kuponkikenttään lahjakortin lunastamiseksi. Oletus: sallittu.

source: Remove card after checkout
fi: Poista kortti kassan jälkeen

source: After an order is placed the gift card will remain in the session for use with future purchases. Check this box to automatically remove the card from the session instead. Default: Unchecked
fi: Tilauksen tekemisen jälkeen lahjakortti pysyy istunnossa tulevien ostojen yhteydessä. Valitse tämä ruutu, jos haluat poistaa kortin automaattisesti istunnosta. Oletus: Ei valittu

source: Use Font Awesome Icon
fi: Käytä Font Awesome ikoneita

source: On the customer facing "Check Balance" page, show a gift card icon from the %s library.
fi: Näytä asiakkaan "Tarkista tasapaino" -sivulla lahjakortti-kuvake %s kirjastosta.

source: Default Redeem URL
fi: Oletus lunastusosoite

source: The link for the Redeem button on the gift card email. Include the https prefix, the Gift Card Number is automatically appended in the URL. Can be different per Design.
fi: Lunastuspainikkeen linkki lahjakorttiviestissä. Sisältää https-etuliitteen, lahjakortin numero lisätään automaattisesti url-osoitteeseen. Voi olla ulkoasukohtainen.

source: Show Balances by Date
fi: Näytä saldot päivämäärittäin

source: On the Balances page in the admin area, optionally show a date picker to show the balances as of a certain date.
fi: Voit valinnaisesti näyttää saldosivun hallintanäkymässä päivämäärävalitsimen näyttääksesi vain tietyn päivän saldot.

source: Configuration error detected by
fi: Asetusvirhe havaittu

source: Your PayPal payment gateway is incorrectly configured. You should not have both IPN and PDT enabled. The "IPN Email Notifications" setting is enabled and there is also a "PayPal Identity Token" (PDT) value set. PayPal is reaching back to your site twice to confirm the payment. This causes things to happen twice including email notifications, stock reduction, and gift card generation. Go to WooCommerce -> Settings -> Payments -> PayPal and either clear the value from the "PayPal Identity Token" field or disable the "IPN Email Notifications" setting.
fi: PayPal maksuyhdyskäytäväsi on konfiguroitu väärin. Sinulla ei pitäisi olla sekä IPN ja PDT päällä yhtäaikaa. "IPN Email Notifications" asetus on aktivoitu, ja myös "PayPal Identity Token" (PDT) arvo on asetettuna. PayPal yhdistää takaisin sivuusi kaksi kertaa varmistaaksesi maksun. Tämä aiheuttaa sen, että asiat tapahtuvat kahdesti sisältäen sähköpostihuomautukset, varaston vähennyksen ja lahjakortin luonnin. Mene WooCommerce -> Asetukset -> Maksut -> PayPal ja joko poista arvo "PayPal Identity Token" kentästä tai poista käytöstä "IPN Email Notifications" asetus.

source: Dismiss this notice
fi: Sulje huomautus

source: Our Plugins
fi: Muut lisäosamme

source: Adjustment amount? Can be positive or negative.
fi: Muutettava summa? Voi olla joko positiivinen tai negatiivinen.

source: Note
fi: Viesti

source: Expiration Date (YYYY-MM-DD)
fi: Viimeinen käyttöpäivä (YYYY-MM-DD)

source: Recipient Email Address
fi: Vastaanottajan sähköpostiosoite

source: From
fi: Lähettäjä

source: Note (optional)
fi: Viesti (valinnainen)

source: Email has been sent.
fi: Sähköposti lähetetty.

source: Are you sure you want to delete this design?
fi: Oletko varma, että haluat poistaa tämän ulkoasun?

source: Note: Be sure to save changes before sending a preview email.
fi: Viesti: muista tallentaa muutokset ennen esikatseluviestin lähettämistä.

source: Recipient email address?
fi: Vastaanottajan sähköpostiosoite?

source: The gift card was permanently deleted from the database.
fi: Lahjakortti poistettiin pysyvästi tietokannasta.

source: Wait
fi: Odota

source: Add
fi: Lisää

source: Remove
fi: Poista

source: Amount must be greater than zero.
fi: Summan tulee olla suurempi kuin nolla.

source: Amount must be greater than minimum amount.
fi: Summan tulee olla suurempi kuin vähimmäissumma.

source: Amount must be less than maximum amount.
fi: Summan tulee olla pienempi kuin enimmäissumma.

source: Error
fi: Virhe

source: Add a bonus amount
fi: Lisää lisäsumma

source: Gift card amount that triggers the bonus?
fi: Lahjakortin summa, joka mahdollistaa lisän?

source: Bonus gift card amount?
fi: Lisälahjakortin summa?

source: Gift Card
fi: Lahjakortti

source: Could not locate product id %s
fi: Tuote id:tä %s ei löytynyt

source: Could not locate product using product_id
fi: Tuotetta ei löytynyt product_id tietueella

source: Gift Card Amount and Bonus amount are both required.
fi: Sekä lahjakortin summa että lisä vaaditaan.

source: Buy a %s gift card, get a %s bonus card
fi: Osta %s lahjakortti, saat %s lisälahjakortin

source: Created %s gift cards.
fi: Luotiin %s lahjakorttia.

source: Error: %s
fi: Virhe: %s

source: Imported
fi: Tuotu

source: Too many columns.
fi: Liian monta palstaa.

source: Gift card number already exists.
fi: Lahjakortin numero on jo olemassa.

source: Invalid gift card number: %s
fi: Lahjakortin numero ei kelpaa: %s

source: Invalid balance amount: %s
fi: Saldo ei kelpaa: %s

source: Invalid expiration date: %s
fi: Viimeinen käyttöpäivä ei kelpaa: %s

source: None
fi: Ei mitään

source: Malformed request.
fi: Huonosti muotoiltu pyyntö.

source: Settings saved.
fi: Asetukset tallennettu.

source: Unable to find suitable slug for check balance page.
fi: Saldontarkitussivulle ei löytynyt sopivaa polkutunnusta.

source: Gift Card Balance
fi: Lahjakortin saldo

source: Balance adjusted.
fi: Saldo muutettu.

source: Note added.
fi: Viesti lisätty.

source: Unable to parse expiration date.
fi: Viimeisen käyttöpäivän tunnistaminen ei onnistunut.

source: Gift card not found.
fi: Lahjakorttia ei löytynyt.

source: Gift Card Number and Email Address are both required.
fi: Sekä lahjakortin numero että sähköpostiosoite vaaditaan.

source: Error: Invalid Design ID %s.
fi: Virhe: ulkoasun ID %s ei kelpaa.

source: Design %s
fi: Ulkoasu %s

source: Design saved.
fi: Ulkoasu tallennettu.

source: Preview email system
fi: Esikatsleu

source: Recipient Name
fi: Vastaanottajan nimi

source: Gift card message to the recipient from the sender.
fi: Lahjakortin viesti vastaanottajalle lähettäjältä.

source: Email sent.
fi: Sähköposti lähetetty.

source: Enter the license key that was sent to your email address.
fi: Syötä sähköpostitse saamasi lisenssiavain.

source: License Key
fi: Lisenssiavain

source: Activate
fi: Ota käyttöön

source: If you need assistance please contact %s
fi: Jos tarvitset apua, ota yhteyttä %s

source: You may continue using the plugin with all features enabled, however you will no longer receive new updates and features until you renew.
fi: Voit jatkaa lisäosan ja sen kaikkien ominaisuuksien käyttämistä, et tosin saa uusia päivityksiä ja ominaisuuksia ennen kuin uusit lisenssin.

source: Renew your license
fi: Uusi lisenssisi

source: Hide this notice
fi: Piilota ilmoitus

source: Need help? Email %s
fi: Tarvitsetko apua? Lähetä viesti %s

source: Leave a review on WordPress.org.
fi: Jätä arvostelu WordPress.org-sivulle.

source: Create a "%s" product to start selling Gift Cards.
fi: Luo "%s" tuote ja ala myydä lahjakortteja.

source: Create the Gift Card product
fi: Luo lahjakorttituote

source: Success!
fi: Onnistui!

source: The Gift Card product has been created. Click on the Products menu in the left to edit it.
fi: Lahjakorttituote luotu. Klikkaa Tuotteet ohjausvalikosta muokataksesi tuotetta.

source: Let your customers check their gift card balances.
fi: Salli asiakkaiden tarkistaa lahjakorttiensa saldo.

source: Create the Check Gift Card Balance page.
fi: Luo saldontarkistussivu.

source: Create a page with the %s
fi: Luo sivu %s: llä

source: The check gift card balance page has been created. Click on the Pages menu in the left to edit it.
fi: Lahjakortin saldontarkistussivu on luotu. Klikkaa hallintavalikosta Sivut muokataksesi sivua.

source: PW Gift Card
fi: PW Lahjakortti

source: (inactive)
fi: (pois käytöstä)

source: (deleted)
fi: (poistettu)

source: No default
fi: Ei oletusta

source: The purchasing customer
fi: Maksaja

source: The gift card recipient.
fi: Lahjakortin vastaanottaja.

source: Gift card amounts
fi: Lahjakortin summat

source: The available denominations that can be purchased. For example: %1$s25.00, %1$s50.00, %1$s100.00
fi: Saatavilla olevat vaihtoehdot, joista asiakas voi valita. Esimerkiksi: %1$s25.00, %1$s50.00, %1$s100.00

source: Allow custom amounts
fi: Salli vapaavalintaiset summat

source: Allow the customer to specify the gift card amount when purchasing.
fi: Salli asiakkaan valita vapaavalintainen summa lahjakortille.

source: Minimum amount
fi: Vähimmäismäärä

source: The minimum gift card amount that can be chosen by the customer. Required.
fi: Vähimmäismäärä, jonka asiakas voi valita. Pakollinen.

source: Maximum amount
fi: Enimmäismäärä

source: The maximum gift card amount that can be chosen by the customer. Required.
fi: Enimmäismäärä, jonka asiakas voi valita. Pakollinen.

source: Include recipient name
fi: Sisällytä vastaanottajan nimi

source: Allow the customer to specify a friendly name for the gift card recipient when purchasing. (Dad, Mom, Uncle Joe, etc)
fi: Salli asiakkaan lisätä hellittelynimi lahjakortin vastaanottajalle lahjakortin ostamisen yhteydessä. (isä, äiti, setä Samuli, tms.)

source: Ignore coupons
fi: Älä huomioi kuponkeja

source: Check this box and coupons will not discount the purchase price of a gift card, although they will still apply to other items in the cart. Default: Unchecked.
fi: Valitse tämä asetus, jotta alennuskupongit eivät alenna lahjakorttituotteen hintaa, mutta vaikuttavat muihin ostoskorin tuotteisiin normaalisti: Oletus: ei käytössä.

source: Default amount
fi: Oletussumma

source: The amount that is pre-selected when a customer first views this product. They can choose another amount.
fi: Esivalittu summa, joka näytetään, kun asiakas tulee ensimmäisen kerran tuotesivulle. Asiakas voi kuitenkin aina valita haluamansa summan.

source: Physical gift card?
fi: Fyysinen lahjakortti?

source: When checked, the generated gift card number will be emailed to address specified below. A physical gift card should be created and mailed to the Shipping Address on the order. Leave unchecked for traditional eGift cards. Default: Unchecked.
fi: Valittuna luotu lahjakorttinumero toimitetaan alla oleviin osoitteisiin. Fyysinen lahjakortti pitää luoda ja toimittaa tilauksen toimitusosoitteeseen. Jätä valitsematta perinteisiä sähköisiä lahjakortteja varten. Oletus: ei valittu.

source: Recipient email address
fi: Vastaanottajan sähköpostiosoite

source: The email address that will receive the generated gift card number. This person will print the gift card and mail it to the shipping address. Leave blank if you do not want to generate a gift card number for this product (for example, if you have pre-printed gift cards).
fi: Sähköpostiosoite, joka vastaanottaa luodun lahjakortin numeron. Tämä henkilö tulostaa lahjakortin ja postittaa sen toimitusosoitteeseen. Jätä tyhjäksi, jos et halua tuottaa lahjakortin numeroa tälle tuotteelle (esimerkiksi jos sinulla on esipainettu lahjakortti).

source: Expires in X days
fi: Vanhuu X päivän kuluttua

source: (optional) The number of days after the purchase date when the gift card will expire. If blank, the gift card will not expire.
fi: (valinnainen) päivien määrä ostopäivän jälkeen, kun lahjakortti vanhenee. Lahjakortti ei vanhene, jos tämä jätetään tyhjäksi.

source: In accordance with the %s, US-based gift cards should not expire for at least 5 years (1,825 days).
fi: %s: n mukaan USA: n pohjaisten lahjakorttien ei tulisi vanhentua vähintään 5 vuotta (1 825 päivää).

source: Email Design
fi: Sähköpostin ulkoasu

source: The email sent to the recipient will feature this design.
fi: Lähetettävä sähköposti käyttää tätä ulkoasua.

source: Launch the Gift Card Designer
fi: Käynnsitä lahjakortin suunnittelija

source: Enable bonus gift cards?
fi: Ota käyttöön lisälahjakortit?

source: Offering a bonus for purchasing gift cards is a great way to incentivise customers. For example: Buy a $25 gift card, get a $5 bonus card!
fi: Bonuksen tarjoaminen lahjakortin ostajille on loistava tapa kannustaa asiakkaita ostamaan. Esimerkiksi: Osta 25 € lahjakortti, saat 5 € lisälahjakortin!

source: Cumulative bonus
fi: Kumulatiivinen lisä

source: When checked, customer can purchase multiple gift cards to trigger the bonus. Otherwise, exact amount must be purchased to trigger bonus.
fi: Valittuna, asiakas voi ostaa useita lahjakortteja saadakseen lisälahjakortin. Muuten tarkka summa vaaditaan lisän saamiseksi.

source: Who will receive the bonus gift card?
fi: Kenelle lisälahjakortti myönnetään?

source: Commission (%)
fi: Komissio (%)

source: Set the commission for this product.
fi: Aseta komissio tälle tuotteelle.

source: Balances
fi: Saldot

source: Email Designer
fi: Sähköpostin suunnittelija

source: Create Gift Cards
fi: Luo lahjakortteja

source: Import Card Numbers
fi: Tuo lahjakortin numeroita

source: Settings
fi: Asetukset

source: Date
fi: Päivämäärä

source: Action
fi: Toiminta

source: User
fi: Käyttäjä

source: Amount
fi: Summa

source: Balance
fi: Saldo

source: Guest
fi: Vieras

source: Active gift cards
fi: Voimassa olevat lahjakortit

source: Outstanding balances
fi: Merkittävät saldot

source: Apply
fi: Käytä

source: Balances as of date
fi: Saldot päivämäärien mukaan

source: Gift card number or recipient email (leave blank for all)
fi: Lahjakortin numero tai vastaanottajan sähköpostiosoite (jätä tyhjäksi kaikkia varten)

source: Search
fi: Etsi

source: Number of cards
fi: Lahjakorttien määrä

source: Initial balance
fi: Alkusaldo

source: Expiration date (optional)
fi: Viimeinen käyttöpäivä (valinnainen)

source: Recipient Email (optional) - Will be emailed the gift card immediately.
fi: Vastaanottajan sähköpostiosoite (valinnainen) - vastaanottaja saa lahjakortin heti.

source: From (optional) - Shown to the Recipient in the gift card email.
fi: Lähettäjä (valinnainen) - näkyy lahjakorttiviestin vastaanottajalle.

source: Note (optional) - Shown to the Recipient in the gift card email.
fi: Viesti (valinnainen) - näkyy lahjakorttiviestin vastaanottajalle.

source: Create
fi: Luo

source: Select a design to edit or add a new design.
fi: Valitse ulkoasu tai luo uusi.

source: Create a new design
fi: Luo uusi ulkoasu

source: Design name (visible to customers)
fi: Ulkoasun nimi (näkyy asiakkaille)

source: Gift card title
fi: Lahjakortin otsikko

source: Gift card color
fi: Lahjakortin tekstin väri

source: Redeem button color
fi: Lunasta painikkeen väri

source: Redeem button text color
fi: Lunasta painiketekstin väri

source: Go to the %s to customize the background color, subject, email heading, and more.
fi: Mene %s mukauttaaksesi taustaväriä, aihetta, sähköpostin otsikkoa ja muuta.

source: Show additional options
fi: Näytä lisäasetukset

source: Gift card background image URL
fi: Lahjakortin taustakuvan url

source: Outlook does not display background images.
fi: Outlook ei näytä taustakuvia.

source: We recommend a 500x275 pixel image.
fi: Suosittelemme 500x275 pikselin kokoista kuvaa.

source: Sample
fi: Esimerkki

source: Recipient text color
fi: Vastaanottajatekstin väri

source: Message text color
fi: Viestitekstin väri

source: Gift card title color
fi: Lahjakortin otsikon väri

source: Amount label color
fi: Summan otsikon väri

source: Amount color
fi: Summan väri

source: Gift card number label color
fi: Lahjakortin numeron otsikon väri

source: Gift card number color
fi: Lahjakortin numeron väri

source: Expiration date label color
fi: Viimeisen käyttöpäivän otsikon väri

source: Expiration Date color
fi: Viimeisen käyttöpäivän väri

source: Gift card border color
fi: Lahjakortin reunan väri

source: Redeem URL
fi: Lunastuksen url

source: The link for the Redeem button on the gift card email. Include the https prefix, the Gift Card Number is automatically appended in the URL.
fi: Lunastuspainikkeen linkki lahjakorttiviestissä. Sisältää https-etuliitteen, lahjakortin numero lisätään automaattisesti url-osoitteeseen.

source: Want even more control?
fi: Haluatko lisää asetuksia?
